examples/aerodynamicHeating/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{

    symmetry
    {
        type        empty;
    }

    farField
    {
        type        characteristicFarfieldTemperature;
        U           ( 1000.0 0.0 0.0 );
        p           100000.0;
        T           293.0;
        value       $internalField;
    }

    fluidToSolid
    {
        // Fixed flux
        //type            externalWallHeatFluxTemperature;
        //kappaMethod     fluidThermo;
        //q               uniform 1e5; // W/m^2
        //value           $internalField;

        // Coupled
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
