examples/aerodynamicHeating/0/fluid/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    symmetry
    {
        type        empty;
    }

    farField
    {
        type        calculated;
        value       $internalField;
    }

    fluidToSolid
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
